Enums/РежимыДистанционнойРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>РежимыДистанционнойРаботы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДистанционнаяРабота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомбинированнаяДистанционнаяРабота</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РежимыДистанционнойРаботы/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	
	ДанныеВыбора.Добавить(Перечисления.РежимыДистанционнойРаботы.ПустаяСсылка(), НСтр("ru = 'Работа по месту нахождения работодателя'"));
	ДанныеВыбора.Добавить(Перечисления.РежимыДистанционнойРаботы.КомбинированнаяДистанционнаяРабота);
	ДанныеВыбора.Добавить(Перечисления.РежимыДистанционнойРаботы.ДистанционнаяРабота);
	
КонецПроцедуры
